#include	"IIC.h"

//延时
void I2C_delay(void)
{
    unsigned char i;

    i = 1;
    while (--i);
}

void Start()
{
    I2C_SCL_Set();
    I2C_SDA_Set();

    I2C_delay();
    I2C_SDA_Clr();
    I2C_delay();
    I2C_SCL_Clr();
}

//========================================================================
// 函数: void SendData (char dat)
// 描述: I2C发送一个字节数据函数.
// 参数: 发送的数据.
// 返回: none.
//========================================================================
void SendData(u8 dat)
{
    u8 i;
    for(i = 0; i < 8; i++)
    {
        I2C_SCL_Clr();//将时钟信号设置为低电平
        if(dat & 0x80) //将dat的8位从最高位依次写入
        {
            I2C_SDA_Set();
        }
        else
        {
            I2C_SDA_Clr();
        }
        I2C_delay();
        I2C_SCL_Set();
        I2C_delay();
        I2C_SCL_Clr();
        dat <<= 1;
    }
}

//========================================================================
// 函数: void RecvACK (void)
// 描述: I2C获取ACK函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-15
//========================================================================

void RecvACK()
{
    I2C_SDA_Set();
    I2C_delay();
    I2C_SCL_Set();
    I2C_delay();
    I2C_SCL_Clr();
    I2C_delay();
}

//========================================================================
// 函数: char RecvData (void)
// 描述: I2C读取一个字节数据函数.
// 参数: none.
// 返回: 读取数据.
// 版本: V1.0, 2020-09-15
//========================================================================
char RecvData(u8 SF_Ack)
{
    u8 Rb_Cnt = 0; //读数据位计数
    u8 RByte  = 0; //读字节
    //I2C_SDA_Dir(0);//SDA设置为输入
    for(Rb_Cnt = 0; Rb_Cnt < 8; Rb_Cnt++)
    {
        I2C_SCL_Clr(); //拉低时钟线   准备开始传送数据位
        I2C_delay();
        I2C_SCL_Set(); //拉高时钟线
        RByte <<= 1; //数据移位
        if(I2C_SDA)
        {
            RByte++;
        }
        I2C_delay();
    }
    if(!SF_Ack)    //0	不发送Ack
    {
        SendNAK(); //发送NAck
    }
    else           //1		发送Ack
    {
        SendACK();  //发送Ack
    }
    return RByte;
}

//========================================================================
// 函数: void SendACK (void)
// 描述: I2C发送ACK函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-15
//========================================================================
void SendACK()
{
    I2C_SCL_Clr();   //拉低时钟线
    // I2C_SDA_Dir(1);//I2C_SDA线输出
    I2C_SDA_Clr();   //拉低数据线
    I2C_delay();;
    I2C_SCL_Set();   //拉高时钟线
    I2C_delay();;
    I2C_SCL_Clr();   //拉低时钟线
}

//========================================================================
// 函数: void SendNAK (void)
// 描述: I2C发送NAK函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-15
//========================================================================
void SendNAK()
{
    I2C_SCL_Clr();   //拉低时钟线
    // I2C_SDA_Dir(1);//I2C_SDA线输出
    I2C_SCL_Set();   //拉高数据线
    I2C_delay();;
    I2C_SCL_Set();   //拉高时钟线
    I2C_delay();;
    I2C_SCL_Clr();   //拉低时钟线
}

//========================================================================
// 函数: void Stop (void)
// 描述: I2C总线停止函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-15
//========================================================================
void Stop()
{
    I2C_SDA_Clr();
    I2C_SCL_Set();
    I2C_delay();
    I2C_SDA_Set();
}

